[
    {
    "date": "14 May 2024",
    "update": "So I guess this is a big update because I redid the entire site. It's <rainbow-text>BRAND SPANKING NEW, BABY</rainbow-text>. Heck yeah. I'm still working on some pages, so there may some dead links in the menu."
    },

    {
        "date": "17 May 2024",
        "update": "Added my 1990s website history. Its not complete, but its a start. Also updated some links in the nav menu. And I added a guestbook."
    },

    {
        "date": "23 May 2024",
        "update": "Updated the menu to be expandable. Added a shrine section. No content yet though! Added a commonplace book. But also not much content there yet. Added a blog, which is an RSS feed of my dreamwidth journal."
    },

    {
        "date": "13 June 2024",
        "update": "Completely redid the site so it looks prettier. Added a gingham background (css) and some pics, redid the layout. Looks much better now imo! Also working on a few pages that are not complete"
    },

    {
        "date": "24 July 2024",
        "update": "Finished my A24 (movie stuff) page. Updated the 'What I use (about) page. Updated the links page. Added a Cozy Fantasy/Sci-Fi page (book stuff)."
    },

    {
        "date": "19 August 2024",
        "update": " New layout! changed the guestbook to atabook, added a page about Vampire Resource Management, fixed a bunch of things."
    },

    {
        "date": "25 August 2024",
        "update": "Livejournal/Dreamwidth stuff: Added a 100x100 icon archive of the icons I have made over the years, a page of friends only banners, and a mood theme. "
    },

    {
        "date": "3 September 2024",
        "update": "added a lexicon/book of words with some cool words that I like in it. Fixed a few things behind the scenes."
    },

    {
        "date": "15 April 2025",
        "update": "moved the navigation from a sidebar to a top nav. also got rid of some pages I wasn't happy with. they may come back later. they may not."
    },

    {
        "date": "12 May 2025",
        "update": "added the noAI webring to the front page. readded my about and use pages. fixed a few things. Added a new theme (blue), added my fav movies page back, added a links page, updated the A24 challenge page"
    },

    {
        "date": "11 June 2025",
        "update": "Updated the links page with some new sites in most categories! check them out! Also joined the TF2 webring."
    },

    {
        "date": "8 July 2025",
        "update": "Added a dyslexic theme. I hope this works, feel free to let me know if its not right. tidied up my code a little bit. Started making my site a little more accessible. LOTS of work still to go. Moved the shinies page under \"stuff\" in the menu. Added some links to the links page"
    },

    {
        "date": "15 July 2025",
        "update": "Rearranged some pages and cleaned up my css a lot. also added a cook book! Only a few recipes for now and no images, but more to come!"
    },

    {
        "date": "8 August 2025",
        "update": "updated my A24 list with some movies I saw and made it look better. Added a Webmeji to the front page. Added some new quotes to the generator. Added a page for my favourite characters in fandom section, added some stamps to the shinies page. Added a youtube section to the links page"
    },

    {
        "date": "8 September 2025",
        "update": "Added some seen movies to A24 challenge, added a favourite music page, added a favourite movies page. Added a solo TTRPG page, and a gaming journal for the Koriko Solo Journalling TTRPG, and for 5-min-machine. Redid my book log so it no longer relies on goodreads widgets. Added some seen movies to the A24 challenge page."
    },

    {
        "date": "28 October 2025",
        "update": "Added a commonplace book, changed the reading log, fav music and fav movie pages so they are filterable. Added a modal/popup for images on commonplace book page. Updated the site credits page and the sitemap. Added a few song to favourite music. Added 2019, 2018 and 2017 to my reading log. Also worked on validating my code and I think I was successful!"
    },

    {
        "date": "29 November 2025",
        "update": "Changed the nav menu to a sidebar, as the top menu with hover dropdowns wasn't at all accessible and it was bothering me. Not sure I like the sidebar, it feels like the page is a bit crowded with it, but for now it will do. Also removed a few pages that I wasn't happy with to redo them. Am planning to redo the colour scheme as the contrast isn't strong enough, not sure what colours to do though!"
    },
    {
        "date": "05 December 2025",
        "update": "Added some blog posts! thats it. nothing exciting."
    }

        
]